export const errors = {
	unauthorized: {
		title: "الوصول غير مصرح به",
		desc: "عذراً، ليس لديك الصلاحيات الكافية للوصول إلى هذه الصفحة أو المجلد. يرجى مراجعة مدير النظام أو تسجيل الدخول بصلاحيات إدارية.",
		btnAdmin: "بوابة الإدارة",
		btnHome: "الرئيسية",
		code: "رمز الخطأ: HTTP 403 FORBIDDEN",
	},
	notFound: {
		title: "الصفحة غير موجودة",
		desc: "عذراً، الصفحة التي تبحث عنها غير موجودة، قد يكون الرابط خاطئاً أو تم حذف الصفحة أو نقلها لموقع آخر.",
		btnHome: "العودة إلى الصفحة الرئيسية",
		code: "رمز الخطأ: HTTP 404 NOT FOUND",
	},
	serverError: {
		title: "حدث خطأ غير متوقع في النظام",
		desc: "عذراً، يواجه الخادم مشكلة فنية داخلية في تلبية الطلب حالياً. نحن نعمل بكل جد على إصلاح الخلل بأسرع وقت ممكن.",
		btnRetry: "إعادة المحاولة",
		btnHome: "الصفحة الرئيسية",
		code: "رمز الخطأ: HTTP 500 INTERNAL SERVER ERROR",
	}
} as const;
